
public class Hellojava {
	
	public static void main(String[] args) {
		
//		out => 표준 출력 장치를 의미한다. 
		System.out.println("춘천 갈까 말까...");
	}

}

// 키워드

// 식별자

// 상수 '' => 문자,  "" => 문자열 상수

// 변수의 선언문, 변수를 사용하기 위해서는 먼저 선언을 해야한다. int num;

// 비트의 정의 : 0, 1 => 정보 표현의 최소단위

// 바이트의 정의 1. 문자 표현의 최소 단위 2. 주소 표현의 최소 단위 8 bit = 1 byte 
// Asicc code, Unicode 왜쓰는가?
// [ 1KB = 1024 Byte ], [ 1MB = 1024 KB ], [ 1GB = 1024 MB ]

//************************************************************************************************************************
// 주기억장치에서는 데이터가 저장된 위치를 표시해준다. 위치를 어떤 방식으로 구분하는 가? 메모리 크기 단위= : 바이트
//************************************************************************************************************************
// 필드 : 의미있는 정보 표현의 최소 단위

// bit byte character field record file